# Why are dynamic, interactive data visualizations useful when communicating data?

Firstly, it broadens the perspective of how to see data. In contrast to the “static” view of data, interactive approaches allow seeing and playing with data multi-dimensionally.
Secondly, this approach can make the data accessible to different audiences, and on the other hand, it can encourage engagement with the data specifically for audiences who might not otherwise care about data and the topic.

In [3]:
# Importing panda
import pandas as pd

In [4]:
# Creating the DataFrame
df1=pd.DataFrame({'x':[1,2,3,4,5], 'y':[6,7,8,9,8], 'z':[3,4,5,6,8]})
df2=pd.DataFrame([{'x':1,'y':2},{'x':3,'y':6},{'x':6,'y':8}])
df1

   x  y  z
0  1  6  3
1  2  7  4
2  3  8  5
3  4  9  6
4  5  8  8

In [5]:
# Showing the indices of DataFrame
df1.index

RangeIndex(start=0, stop=5, step=1)

In [6]:
# Showing the head of the DataFrame ( The first two rows)
df1.head(2)

   x  y  z
0  1  6  3
1  2  7  4

In [7]:
# Showing the column of 'x' ( The first Column)
df1['x']

0    1
1    2
2    3
3    4
4    5
Name: x, dtype: int64

In [11]:
# Another way of showing the first Column
df1.x

0    1
1    2
2    3
3    4
4    5
Name: x, dtype: int64

In [10]:
# first row of the dataframe
df1[0:0]

Empty DataFrame
Columns: [x, y, z]
Index: []

In [19]:
# Showing the index 2 of column x
df2["x"][2]

6

In [8]:
# Locating the index 1 of column x
df2['x'].loc[1]

3

In [9]:
# Index Locating the index 1 of column x
df2['x'].iloc[1]

3

In [27]:
# operation indexing of dataframe
newDf= df2[df2['x']>2]['x']
newDf

1    3
2    6
Name: x, dtype: int64

In [28]:
# Writing data to the new csv file
newDf.to_csv('Modified_Data.csv')

In [31]:
# Adding a new column to the dataframe
df2['k']=[3,4,5]
df2

   x  y  k
0  1  2  3
1  3  6  4
2  6  8  5

In [33]:
df2['j']=[x/2 for x in df2['x']]
df2

   x  y  k    j
0  1  2  3  0.5
1  3  6  4  1.5
2  6  8  5  3.0